{"_id":{"$oid":"6834cd7e3f030b6ae2678985"},"courseName":"Hemorragia Postparto 2025-2","courseDescription":"La hemorragia postparto (HPP) es una causa importante de morbilidad y mortalidad materna. Este curso para estudiantes de medicina de pregrado aborda la identificación, evaluación y manejo integral de la HPP mediante contenidos teóricos, casos clínicos y recursos visuales. Los participantes aprenderán a reconocer signos de alarma, aplicar algoritmos actualizados y tomar decisiones clínicas en escenarios simulados. El curso forma parte de la formación clínica en ginecología y obstetricia y se organiza en tres momentos: actividad previa, encuentro sincrónico o asincrónico, y trabajo independiente con evaluación","professorIds":["luisBau@gmail.com"],"studentIds":["camilo@gmail.com"],"beforeClass":{"instructions":{"instructionTitle":"Hemorragia Postparto - Estrategia CODIGO ROJO","instructionDescription":"Descripción: En esta actividad previa te prepararás para el estudio del manejo de la hemorragia postparto mediante una revisión introductoria de los conceptos fundamentales. El objetivo es activar conocimientos previos y familiarizarte con el contexto clínico en el que se desarrolla esta urgencia obstétrica.","time":1,"steps":["Revisar las guias de HPP (OPS2023- FIGO2022)"," Identificar conceptos clave relacionados con la fisiopatología y factores de riesgo de la HPP."," Leer un breve caso clínico que plantea una situación real en sala de partos.","Responder unas preguntas de reflexión para activar tu pensamiento clínico."]},"contents":[{"contentTitle":"Guia OPS 2024","contentDescription":"Esta es una guía muy amigable de texto e imagenes que les ayudará a comprender el diagnóstico, forma de activar el código rojo e iniciar la atención de la pacientecon hemorragia postparto  ","time":30,"imageUrl":"blob:https://sima.uis.edu.co/7bf22ed0-966c-454e-9018-1a2edf5570c9"},{"contentTitle":"bxbxb","contentDescription":"","time":1}],"evaluations":[{"question":"¿Cuál es la causa más frecuente de HPP?","questionDescription":"atonía","time":1},{"question":"Según lo aprendido en el caso clínico, ¿qué acción inmediata consideras clave en el primer minuto de detectar un sangrado anormal","questionDescription":"Masaje uterino bimanual","time":1}]},"duringClass":{"instructions":{"instructionTitle":"","instructionDescription":"","time":0,"steps":["Analiza una situación real de hemorragia postparto con datos e historia clínica.",""]},"contents":[{"contentTitle":"s","contentDescription":"","time":1}],"evaluations":[{"question":"sfa","questionDescription":"","time":1}]},"afterClass":{"instructions":{"instructionTitle":"Práctica HPP","instructionDescription":"Al finalizar la sesión, continúa practicando de forma autónoma con el simulador o la experiencia de realidad extendida para fortalecer tus habilidades y decisiones clínicas en hemorragia postparto. Esta práctica es fundamental para prepararte a brindar una atención segura y efectiva.","time":22,"steps":["Repite el manejo de casos de hemorragia postparto usando el simulador para fortalecer tu toma de decisiones.","Si está disponible, usa esta herramienta para vivenciar escenarios clínicos inmersivos y mejorar tu respuesta en situaciones reales.","Revisa tus decisiones, identifica áreas para mejorar y consulta los recursos para profundizar tus conocimientos."]},"contents":[{"contentTitle":"Modulo HPP","contentDescription":"","time":1}],"evaluations":[{"question":"¿Qué criterios clínicos usarías para decidir pasar a un segundo uterotónico? ","questionDescription":"Sangrado persistente y útero aún blando tras la oxitocina. ","time":1},{"question":" ¿En qué situación se aplica el balón de Bakri en el manejo de la hemorragia postparto? ","questionDescription":"Cuando los uterotónicos no logran detener la hemorragia por atonía uterina.","time":1}]},"imageUrl":"","momentStatus":{"beforeClass":{"instructions":"completo","contents":"completo","evaluations":"completo"},"duringClass":{"instructions":"completo","contents":"completo","evaluations":"completo"},"afterClass":{"instructions":"completo","contents":"completo","evaluations":"completo"}},"teacherName":"Luis Eduardo","teacherTitle":"Magister Diseño Industrial","teacherEmail":"luiseduardo@gmail.com","_class":"com.proyectogrado.plataforma.course.Model.Course"}
{"_id":{"$oid":"687d2f1dbca59b6525eca75c"},"courseName":"Programación Avanzada","courseDescription":"","professorIds":["luisBau@gmail.com"],"studentIds":["levir@gmail.com"],"beforeClass":{"instructions":{"instructionTitle":"","instructionDescription":"","time":0,"steps":[]},"contents":[],"evaluations":[]},"duringClass":{"instructions":{"instructionTitle":"","instructionDescription":"","time":0,"steps":[]},"contents":[],"evaluations":[]},"afterClass":{"instructions":{"instructionTitle":"","instructionDescription":"","time":0,"steps":[]},"contents":[],"evaluations":[]},"imageUrl":"","teacherName":"Luis Eduardo","teacherTitle":"Magister Diseño Industrial","teacherEmail":"luiseduardo@gmail.com","_class":"com.proyectogrado.plataforma.course.Model.Course"}
